[
  {
    "Likelihood Of Attack": "High",
    "condition": "target.implementsCommunicationProtocol and target.controls.authenticatesDestination is False and target.controls.authenticatesSource is False",
    "description": "Choosing Message Identifier",
    "details": "This pattern of attack is defined by the selection of messages distributed via multicast or public information channels that are intended for another client by determining the parameter value assigned to that client. This attack allows the adversary to gain access to potentially privileged information, and to possibly perpetrate other attacks through the distribution means by impersonation. If the channel/message being manipulated is an input rather than output mechanism for the system, (such as a command bus), this style of attack could be used to change the adversary's identifier to more a privileged one.",
    "example": "An attacker may intercept a communication channel and manipulate the message identifiers to impersonate another client and gain access to privileged information.",
    "mitigations": "Associate some ACL (in the form of a token) with an authenticated user which they provide middleware. The middleware uses this token as part of its channel/message selection for that client, or part of a discerning authorization decision for privileged channels/messages. The purpose is to architect the system in a way that associates proper authentication/authorization with each channel/message. Re-architect system input/output channels as appropriate to distribute self-protecting data. That is, encrypt (or otherwise protect) channels/messages so that only authorized readers can see them.",
    "prerequisites": "Information and client-sensitive (and client-specific) data must be present through a distribution channel available to all users. Distribution means must code (through channel, message identifiers, or convention) message destination in a manner visible within the distribution means itself (such as a control channel) or in the messages themselves.",
    "references": "https://cwe.mitre.org/data/definitions/201.html, https://cwe.mitre.org/data/definitions/306.html",
    "severity": "High",
    "target": [
      "Process",
      "Server",
      "Dataflow"
    ],
    "SID": "TEST"
  }
]
