[
  {
    "Likelihood Of Attack": "Medium",
    "condition": "target.allowsClientSideScripting is True and target.controls.disablesiFrames is False and target.controls.implementsCSRFToken is False and target.controls.implementsStrictHTTPValidation is False and target.controls.sanitizesInput is False and target.controls.validatesHeaders is False and target.controls.validatesInput is False",
    "description": "Clickjacking",
    "details": "An adversary tricks a victim into unknowingly initiating some action in one system while interacting with the UI from a seemingly completely different, usually an adversary controlled or intended, system.",
    "example": "The victim is logged in to their bank's website and has an active session. The victim then visits a seemingly unrelated site which hosts malicious code. This code overlays a transparent iFrame of the bank's website over a button on the malicious site. When the victim clicks on the button, they unknowingly initiate a money transfer on their bank's website.",
    "mitigations": "If using the Firefox browser, use the NoScript plug-in that will help forbid iFrames. Turn off JavaScript, Flash and disable CSS. When maintaining an authenticated session with a privileged target system, do not use the same browser to navigate to unfamiliar sites to perform other activities. Finish working with the target system and logout first before proceeding to other tasks.",
    "prerequisites": "The victim is communicating with the target application via a web based UI and not a thick client The victim's browser security policies allow at least one of the following JavaScript, Flash, iFrames, ActiveX, or CSS. The victim uses a modern browser that supports UI elements like clickable buttons (i.e. not using an old text only browser) The victim has an active session with the target system. The target system's interaction window is open in the victim's browser and supports the ability for initiating sensitive actions on behalf of the user in the target system",
    "references": "http://cwe.mitre.org/data/definitions/1021.html",
    "severity": "High",
    "target": [
      "Process",
      "Server"
    ],
    "SID": "TEST"
  }
]
